// © Copyright 2010-2016 HP Development Company, L.P.

TaskName = "Scan to Computer";
TaskDescription = "Scan to Computer lets you start scans at the front panel of your HP device, and automatically send the output to your computer.";

MoreInfoButtonToolTipTitle = "More Info on Scan to Computer";

"COMPUTER_NAME_TITLE" = "Your computer name is";
"COMPUTER_NAME_DESCRIPTION" = "When you start a scan from your HP device you may be prompted to select your computer from a list of Scan to Computer-enabled host computers.";
ComputerNameWithDefaultDestinationDescription = "When you start a scan from your HP device you may be prompted to select your computer from a list of Scan to Computer-enabled host computers. Scans will be saved to default destination. To edit the scanning tasks, click the \"Edit Scan Tasks\" button.";
"COMPUTER" = "Computer";
"COMPUTERS" = "Computers";

"INSTALLATION_ERROR" = "The HP software required for Scan to Computer could not be located on this computer. Please download and install the latest HP recommended software for your device from http://www.hp.com/support, and then try again.";
HSDNoHPScanDriverErrorMessage = "The HP software required for Scan to Computer could not be loaded. Please download and install the latest software for your HP device from http://www.hp.com/support, and then try again. If the problem persists, restart your Mac and the HP device.";

EnableScanToComputerCheckBoxTitle = "Enable Scan to Computer";

EnablingScanToComputerProgressTitle = "Enabling Scan to Computer…";

ScanToComputerIsEnabledTitle = "Scan to Computer is Enabled";
ChangeComputerNameButtonTitle = "Change Computer Name…";

ScanToComputerDisabledTitle = "Scan to Computer is Disabled";
ScanToComputerDisabledDescriptionTitle = "You still can start scans from your computer's scanning software — for example, from HP Easy Scan.";

ScanToComputerCannotBeEnabledTitle = "Scan to Computer Cannot Be Enabled";

EnablingFailedCause1Title = "Possible Cause #1: The maximum number computers are already enabled. To enable Scan to Computer, another computer must first disable this feature.";
EnablingFailedCause2Title = "Possible Cause #2: Unable to communicate with device. Check cables and connection settings. If the problem persists, try restarting your computer and the HP device.";
ShowEnabledComputersButtonTitle = "View Enabled Computers";

CommunicationErrorTitle = "Communication Error";
CommunicationErrorDescriptionTitle = "Unable to communicate with device. Check cables and connection settings. If the problem persists, try restarting your computer and the HP device.";

EditScanTasksButtonTitle = "Edit Scan Tasks…";
EditScanTasksButtonToolTipTitle = "View and edit scanning tasks in HP Easy Scan application (or HP Scan for some products)";
CannotEditScanTasksErrorTitle = "HP Easy Scan cannot be found";
HSDNoHPScanErrorMessage = "HSD_TEXT:HP Easy Scan (or HP Scan for some products) is required to view and edit scan task settings. Download and install the latest software for your product at HSD_LINK:HSD_URL:HSDSupportLink_URL.";
HSDOutdatedHPScanErrorMessage = "HSD_TEXT:Your HP Scan software needs updating. HSDNoHPScanErrorMessage";

// Enabled Computers List
TableTile = "Currently Enabled for Scan to Computer";
MaximumEnabledComputersAmountTitle = "Maximum Enabled for this Device :";
